---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotConstrainBasePointDimensions
source: html/9f2a3a1b-50d7-0505-66e0-9e89a1c27766.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.CannotConstrainBasePointDimensions Property

Dimensions to base points cannot be constrained.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotConstrainBasePointDimensions { get; }
```